fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_adc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX0 register.
//
//*****************************************************************************
#define ADC_SSMUX0_MUX7_M 0xF0000000 // 8th Sample Input Select
#define ADC_SSMUX0_MUX6_M 0x0F000000 // 7th Sample Input Select
#define ADC_SSMUX0_MUX5_M 0x00F00000 // 6th Sample Input Select
#define ADC_SSMUX0_MUX4_M 0x000F0000 // 5th Sample Input Select
#define ADC_SSMUX0_MUX3_M 0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX0_MUX2_M 0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX0_MUX1_M 0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX0_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX0_MUX7_S 28
#define ADC_SSMUX0_MUX6_S 24
#define ADC_SSMUX0_MUX5_S 20
#define ADC_SSMUX0_MUX4_S 16
#define ADC_SSMUX0_MUX3_S 12
#define ADC_SSMUX0_MUX2_S 8
#define ADC_SSMUX0_MUX1_S 4
#define ADC_SSMUX0_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL0 register.
//
//*****************************************************************************
#define ADC_SSCTL0_TS7  0x80000000 // 8th Sample Temp Sensor Select
#define ADC_SSCTL0_IE7  0x40000000 // 8th Sample Interrupt Enable
#define ADC_SSCTL0_END7 0x20000000 // 8th Sample is End of Sequence
#define ADC_SSCTL0_D7 \
    0x10000000                     // 8th Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS6  0x08000000 // 7th Sample Temp Sensor Select
#define ADC_SSCTL0_IE6  0x04000000 // 7th Sample Interrupt Enable
#define ADC_SSCTL0_END6 0x02000000 // 7th Sample is End of Sequence
#define ADC_SSCTL0_D6 \
    0x01000000                     // 7th Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS5  0x00800000 // 6th Sample Temp Sensor Select
#define ADC_SSCTL0_IE5  0x00400000 // 6th Sample Interrupt Enable
#define ADC_SSCTL0_END5 0x00200000 // 6th Sample is End of Sequence
#define ADC_SSCTL0_D5 \
    0x00100000                     // 6th Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS4  0x00080000 // 5th Sample Temp Sensor Select
#define ADC_SSCTL0_IE4  0x00040000 // 5th Sample Interrupt Enable
#define ADC_SSCTL0_END4 0x00020000 // 5th Sample is End of Sequence
#define ADC_SSCTL0_D4 \
    0x00010000                     // 5th Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS3  0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL0_IE3  0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL0_END3 0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL0_D3 \
    0x00001000                     // 4th Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS2  0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL0_IE2  0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL0_END2 0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL0_D2 \
    0x00000100                     // 3rd Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS1  0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL0_IE1  0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL0_END1 0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL0_D1 \
    0x00000010                     // 2nd Sample Differential Input
                                   // Select
#define ADC_SSCTL0_TS0  0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL0_IE0  0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL0_END0 0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL0_D0 \
    0x00000001                     // 1st Sample Differential Input
                                   // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFIFO0 register.
//
//*****************************************************************************
#define ADC_SSFIFO0_DATA_M 0x00000FFF // Conversion Result Data
#define ADC_SSFIFO0_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFSTAT0 register.
//
//*****************************************************************************
#define ADC_SSFSTAT0_FULL   0x00001000 // FIFO Full
#define ADC_SSFSTAT0_EMPTY  0x00000100 // FIFO Empty
#define ADC_SSFSTAT0_HPTR_M 0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT0_TPTR_M 0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT0_HPTR_S 4
#define ADC_SSFSTAT0_TPTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSOP0 register.
//
//*****************************************************************************
#define ADC_SSOP0_S7DCOP \
    0x10000000 // Sample 7 Digital Comparator
               // Operation
#define ADC_SSOP0_S6DCOP \
    0x01000000 // Sample 6 Digital Comparator
               // Operation
#define ADC_SSOP0_S5DCOP \
    0x00100000 // Sample 5 Digital Comparator
               // Operation
#define ADC_SSOP0_S4DCOP \
    0x00010000 // Sample 4 Digital Comparator
               // Operation
#define ADC_SSOP0_S3DCOP \
    0x00001000 // Sample 3 Digital Comparator
               // Operation
#define ADC_SSOP0_S2DCOP \
    0x00000100 // Sample 2 Digital Comparator
               // Operation
#define ADC_SSOP0_S1DCOP \
    0x00000010 // Sample 1 Digital Comparator
               // Operation
#define ADC_SSOP0_S0DCOP \
    0x00000001 // Sample 0 Digital Comparator
               // Operation

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSDC0 register.
//
//*****************************************************************************
#define ADC_SSDC0_S7DCSEL_M \
    0xF0000000 // Sample 7 Digital Comparator
               // Select
#define ADC_SSDC0_S6DCSEL_M \
    0x0F000000 // Sample 6 Digital Comparator
               // Select
#define ADC_SSDC0_S5DCSEL_M \
    0x00F00000 // Sample 5 Digital Comparator
               // Select
#define ADC_SSDC0_S4DCSEL_M \
    0x000F0000 // Sample 4 Digital Comparator
               // Select
#define ADC_SSDC0_S3DCSEL_M \
    0x0000F000 // Sample 3 Digital Comparator
               // Select
#define ADC_SSDC0_S2DCSEL_M \
    0x00000F00 // Sample 2 Digital Comparator
               // Select
#define ADC_SSDC0_S1DCSEL_M \
    0x000000F0 // Sample 1 Digital Comparator
               // Select
#define ADC_SSDC0_S0DCSEL_M \
    0x0000000F // Sample 0 Digital Comparator
               // Select
#define ADC_SSDC0_S6DCSEL_S 24
#define ADC_SSDC0_S5DCSEL_S 20
#define ADC_SSDC0_S4DCSEL_S 16
#define ADC_SSDC0_S3DCSEL_S 12
#define ADC_SSDC0_S2DCSEL_S 8
#define ADC_SSDC0_S1DCSEL_S 4
#define ADC_SSDC0_S0DCSEL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSEMUX0 register.
//
//*****************************************************************************
#define ADC_SSEMUX0_EMUX7 \
    0x10000000 // 8th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX6 \
    0x01000000 // 7th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX5 \
    0x00100000 // 6th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX4 \
    0x00010000 // 5th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX3 \
    0x00001000 // 4th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX2 \
    0x00000100 // 3rd Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX1 \
    0x00000010 // 2th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX0_EMUX0 \
    0x00000001 // 1st Sample Input Select (Upper
               // Bit)

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSTSH0 register.
//
//*****************************************************************************
#define ADC_SSTSH0_TSH7_M \
    0xF0000000 // 8th Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH6_M \
    0x0F000000 // 7th Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH5_M \
    0x00F00000 // 6th Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH4_M \
    0x000F0000 // 5th Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH3_M \
    0x0000F000 // 4th Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH2_M \
    0x00000F00 // 3rd Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH1_M \
    0x000000F0 // 2nd Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH0_M \
    0x0000000F // 1st Sample and Hold Period
               // Select
#define ADC_SSTSH0_TSH7_S 28
#define ADC_SSTSH0_TSH6_S 24
#define ADC_SSTSH0_TSH5_S 20
#define ADC_SSTSH0_TSH4_S 16
#define ADC_SSTSH0_TSH3_S 12
#define ADC_SSTSH0_TSH2_S 8
#define ADC_SSTSH0_TSH1_S 4
#define ADC_SSTSH0_TSH0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX1 register.
//
//*****************************************************************************
#define ADC_SSMUX1_MUX3_M 0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX1_MUX2_M 0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX1_MUX1_M 0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX1_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX1_MUX3_S 12
#define ADC_SSMUX1_MUX2_S 8
#define ADC_SSMUX1_MUX1_S 4
#define ADC_SSMUX1_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL1 register.
//
//*****************************************************************************
#define ADC_SSCTL1_TS3  0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL1_IE3  0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL1_END3 0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL1_D3 \
    0x00001000                     // 4th Sample Differential Input
                                   // Select
#define ADC_SSCTL1_TS2  0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL1_IE2  0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL1_END2 0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL1_D2 \
    0x00000100                     // 3rd Sample Differential Input
                                   // Select
#define ADC_SSCTL1_TS1  0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL1_IE1  0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL1_END1 0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL1_D1 \
    0x00000010                     // 2nd Sample Differential Input
                                   // Select
#define ADC_SSCTL1_TS0  0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL1_IE0  0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL1_END0 0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL1_D0 \
    0x00000001                     // 1st Sample Differential Input
                                   // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFIFO1 register.
//
//*****************************************************************************
#define ADC_SSFIFO1_DATA_M 0x00000FFF // Conversion Result Data
#define ADC_SSFIFO1_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFSTAT1 register.
//
//*****************************************************************************
#define ADC_SSFSTAT1_FULL   0x00001000 // FIFO Full
#define ADC_SSFSTAT1_EMPTY  0x00000100 // FIFO Empty
#define ADC_SSFSTAT1_HPTR_M 0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT1_TPTR_M 0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT1_HPTR_S 4
#define ADC_SSFSTAT1_TPTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSOP1 register.
//
//*****************************************************************************
#define ADC_SSOP1_S3DCOP \
    0x00001000 // Sample 3 Digital Comparator
               // Operation
#define ADC_SSOP1_S2DCOP \
    0x00000100 // Sample 2 Digital Comparator
               // Operation
#define ADC_SSOP1_S1DCOP \
    0x00000010 // Sample 1 Digital Comparator
               // Operation
#define ADC_SSOP1_S0DCOP \
    0x00000001 // Sample 0 Digital Comparator
               // Operation

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSDC1 register.
//
//*****************************************************************************
#define ADC_SSDC1_S3DCSEL_M \
    0x0000F000 // Sample 3 Digital Comparator
               // Select
#define ADC_SSDC1_S2DCSEL_M \
    0x00000F00 // Sample 2 Digital Comparator
               // Select
#define ADC_SSDC1_S1DCSEL_M \
    0x000000F0 // Sample 1 Digital Comparator
               // Select
#define ADC_SSDC1_S0DCSEL_M \
    0x0000000F // Sample 0 Digital Comparator
               // Select
#define ADC_SSDC1_S2DCSEL_S 8
#define ADC_SSDC1_S1DCSEL_S 4
#define ADC_SSDC1_S0DCSEL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSEMUX1 register.
//
//*****************************************************************************
#define ADC_SSEMUX1_EMUX3 \
    0x00001000 // 4th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX1_EMUX2 \
    0x00000100 // 3rd Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX1_EMUX1 \
    0x00000010 // 2th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX1_EMUX0 \
    0x00000001 // 1st Sample Input Select (Upper
               // Bit)

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSTSH1 register.
//
//*****************************************************************************
#define ADC_SSTSH1_TSH3_M \
    0x0000F000 // 4th Sample and Hold Period
               // Select
#define ADC_SSTSH1_TSH2_M \
    0x00000F00 // 3rd Sample and Hold Period
               // Select
#define ADC_SSTSH1_TSH1_M \
    0x000000F0 // 2nd Sample and Hold Period
               // Select
#define ADC_SSTSH1_TSH0_M \
    0x0000000F // 1st Sample and Hold Period
               // Select
#define ADC_SSTSH1_TSH3_S 12
#define ADC_SSTSH1_TSH2_S 8
#define ADC_SSTSH1_TSH1_S 4
#define ADC_SSTSH1_TSH0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX2 register.
//
//*****************************************************************************
#define ADC_SSMUX2_MUX3_M 0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX2_MUX2_M 0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX2_MUX1_M 0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX2_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX2_MUX3_S 12
#define ADC_SSMUX2_MUX2_S 8
#define ADC_SSMUX2_MUX1_S 4
#define ADC_SSMUX2_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL2 register.
//
//*****************************************************************************
#define ADC_SSCTL2_TS3  0x00008000 // 4th Sample Temp Sensor Select
#define ADC_SSCTL2_IE3  0x00004000 // 4th Sample Interrupt Enable
#define ADC_SSCTL2_END3 0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL2_D3 \
    0x00001000                     // 4th Sample Differential Input
                                   // Select
#define ADC_SSCTL2_TS2  0x00000800 // 3rd Sample Temp Sensor Select
#define ADC_SSCTL2_IE2  0x00000400 // 3rd Sample Interrupt Enable
#define ADC_SSCTL2_END2 0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL2_D2 \
    0x00000100                     // 3rd Sample Differential Input
                                   // Select
#define ADC_SSCTL2_TS1  0x00000080 // 2nd Sample Temp Sensor Select
#define ADC_SSCTL2_IE1  0x00000040 // 2nd Sample Interrupt Enable
#define ADC_SSCTL2_END1 0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL2_D1 \
    0x00000010                     // 2nd Sample Differential Input
                                   // Select
#define ADC_SSCTL2_TS0  0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL2_IE0  0x00000004 // 1st Sample Interrupt Enable
#define ADC_SSCTL2_END0 0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL2_D0 \
    0x00000001                     // 1st Sample Differential Input
                                   // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFIFO2 register.
//
//*****************************************************************************
#define ADC_SSFIFO2_DATA_M 0x00000FFF // Conversion Result Data
#define ADC_SSFIFO2_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFSTAT2 register.
//
//*****************************************************************************
#define ADC_SSFSTAT2_FULL   0x00001000 // FIFO Full
#define ADC_SSFSTAT2_EMPTY  0x00000100 // FIFO Empty
#define ADC_SSFSTAT2_HPTR_M 0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT2_TPTR_M 0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT2_HPTR_S 4
#define ADC_SSFSTAT2_TPTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSOP2 register.
//
//*****************************************************************************
#define ADC_SSOP2_S3DCOP \
    0x00001000 // Sample 3 Digital Comparator
               // Operation
#define ADC_SSOP2_S2DCOP \
    0x00000100 // Sample 2 Digital Comparator
               // Operation
#define ADC_SSOP2_S1DCOP \
    0x00000010 // Sample 1 Digital Comparator
               // Operation
#define ADC_SSOP2_S0DCOP \
    0x00000001 // Sample 0 Digital Comparator
               // Operation

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSDC2 register.
//
//*****************************************************************************
#define ADC_SSDC2_S3DCSEL_M \
    0x0000F000 // Sample 3 Digital Comparator
               // Select
#define ADC_SSDC2_S2DCSEL_M \
    0x00000F00 // Sample 2 Digital Comparator
               // Select
#define ADC_SSDC2_S1DCSEL_M \
    0x000000F0 // Sample 1 Digital Comparator
               // Select
#define ADC_SSDC2_S0DCSEL_M \
    0x0000000F // Sample 0 Digital Comparator
               // Select
#define ADC_SSDC2_S2DCSEL_S 8
#define ADC_SSDC2_S1DCSEL_S 4
#define ADC_SSDC2_S0DCSEL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSEMUX2 register.
//
//*****************************************************************************
#define ADC_SSEMUX2_EMUX3 \
    0x00001000 // 4th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX2_EMUX2 \
    0x00000100 // 3rd Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX2_EMUX1 \
    0x00000010 // 2th Sample Input Select (Upper
               // Bit)
#define ADC_SSEMUX2_EMUX0 \
    0x00000001 // 1st Sample Input Select (Upper
               // Bit)

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSTSH2 register.
//
//*****************************************************************************
#define ADC_SSTSH2_TSH3_M \
    0x0000F000 // 4th Sample and Hold Period
               // Select
#define ADC_SSTSH2_TSH2_M \
    0x00000F00 // 3rd Sample and Hold Period
               // Select
#define ADC_SSTSH2_TSH1_M \
    0x000000F0 // 2nd Sample and Hold Period
               // Select
#define ADC_SSTSH2_TSH0_M \
    0x0000000F // 1st Sample and Hold Period
               // Select
#define ADC_SSTSH2_TSH3_S 12
#define ADC_SSTSH2_TSH2_S 8
#define ADC_SSTSH2_TSH1_S 4
#define ADC_SSTSH2_TSH0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX3 register.
//
//*****************************************************************************
#define ADC_SSMUX3_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX3_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL3 register.
//
//*****************************************************************************
#define ADC_SSCTL3_TS0  0x00000008 // 1st Sample Temp Sensor Select
#define ADC_SSCTL3_IE0  0x00000004 // Sample Interrupt Enable
#define ADC_SSCTL3_END0 0x00000002 // End of Sequence
#define ADC_SSCTL3_D0   0x00000001 // Sample Differential Input Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFIFO3 register.
//
//*****************************************************************************
#define ADC_SSFIFO3_DATA_M 0x00000FFF // Conversion Result Data
#define ADC_SSFIFO3_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFSTAT3 register.
//
//*****************************************************************************
#define ADC_SSFSTAT3_FULL   0x00001000 // FIFO Full
#define ADC_SSFSTAT3_EMPTY  0x00000100 // FIFO Empty
#define ADC_SSFSTAT3_HPTR_M 0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT3_TPTR_M 0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT3_HPTR_S 4
#define ADC_SSFSTAT3_TPTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSOP3 register.
//
//*****************************************************************************
#define ADC_SSOP3_S0DCOP \
    0x00000001 // Sample 0 Digital Comparator
               // Operation

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSDC3 register.
//
//*****************************************************************************
#define ADC_SSDC3_S0DCSEL_M \
    0x0000000F // Sample 0 Digital Comparator
               // Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSEMUX3 register.
//
//*****************************************************************************
#define ADC_SSEMUX3_EMUX0 \
    0x00000001 // 1st Sample Input Select (Upper
               // Bit)

